# ფუნქცია არის კოდის ბლოკი, რომელსაც სახელი აქვს.
# მას ვქმნით იმისთვის, რომ ერთი და იგივე კოდი ბევრჯერ გამოვიყენოთ.
# ფუნქციას შეიძლება გადავცეთ მნიშვნელობები (არგუმენტები).
# ფუნქციამ შეიძლება რაღაც შედეგიც დააბრუნოს ან უბრალოდ რაღაც დაბეჭდოს.


#3)შექმენით მასივი, შეინახეთ მასში მნიშვნელობები, თქვენი დავალებაა, რომ მოიპოვოთ წვდომა მასივის index - ებზე, ასევე ახსენით თუ რა უნდა გავაკეთოთ ჩვენ იმისათვის, რომ გავიგოთ მასივში არსებული ელემენტების index - ები
numbers = [10, 20, 30, 40, 50]

print(numbers[0])  # 10
print(numbers[3])  # 40


#4) მომხმარებელს შემოატანინეთ რაიმე რიცხვი და სახელი, შექმენით სახელების მასივი, თქვენი დავალებაა, რომ მოცემულ index - ზე ჩასვათ ის მნიშვნელობა რასაც მომხმარებელი ტექსტის სახით შემოიტანს, მაგალითად
names = ["Ana", "Giorgi", "Mariam", "Luka"]

user_index = int(input("შეიყვანე index: "))
user_name = input("შეიყვანე სახელი: ")


names.insert(user_index, user_name)

print(names)



#5) მოიძიეთ დამატებითი ინფორმაცია string method - ების შესახებ, მომხმარებელს შემოატანინეთ მისი სახელი, თქვენი დავალებაა, რომ გამოიტანოთ მომხმარებლის სახელის პირველი ასო დიდ ასოდ და დაბეჭდოთ საბოლოო შედეგი, გამოიყენეთ შესაბამისი მეთოდი
user_name = input("შეიყვანე შენი სახელი: ")

result = user_name.capitalize()

print(result)

#6) კომენტარების სახით ახსენით განსხვავება method, function - ს შორის
# function (ფუნქცია) — არის დამოუკიდებელი კოდის ბლოკი, რომელიც თავისით არსებობს.
# მაგალითად: print(), len(), type()

# method (მეთოდი) — არის ფუნქცია, რომელიც მიბმულია ობიექტს.
# ანუ მეთოდს ყოველთვის წინ აქვს ობიექტი და წერტილი.
# მაგალითად: name.capitalize(), list.append(), list.insert()

#7) name = '    N I N O     ' გამოიყენეთ შესაბამისი მეთოდი იმისათვის, რომ მოაშოროთ ზედმეტი space - ები
name = "    N I N O     "
cleaned = name.strip()

print(cleaned)


#შექმენით ფუნქცია სახელად greet რომელიც პარამეტრად მიიღებს name - ს, თქვენი დავალებაა, რომ დაბეჭდოთ მისალმება შემდეგნაირად Hello name, გამოიძახეთ მოცემული ფუნქცია და გადაეცით მას არგუმენტად სახელი, ასევე ახსენით განსხავვება პარამეტრსა და არგუმენტს შორის
def greet(name):
    print("Hello " + name)
greet("gio")
 