#1) კომენტარების სახით ახსენით თუ რა არის input და რა არის output - მოიყვანეთ მაგალითებიც
#input# Input ნიშნავს მონაცემების შემოტანას პროგრამაში — მაგალითად, როცა მომხმარებელი შეჰყავს თავისი სახელი.
# Output ნიშნავს პროგრამიდან შედეგის გამოყვანას — მაგალითად, დაბეჭდვა ეკრანზე.



#2) მომხმარებელს მოსთხოვეთ რომ შემოიტანოს თავისი სახელი მერე გვარი და ასაკი საბოლოოდ კი დაბეჭდეთ ისინი
name = input("შეიყვანე შენი სახელი: ")
surname = input("შეიყვანე შენი გვარი: ")
age = input("შეიყვანე შენი ასაკი: ")

print("სახელი:", name)
print("გვარი:", surname)
print("ასაკი:", age)

#3) მომხმარებელს შემოატანინეთ თავისი ასაკი შეამოწმეთ თუ ასაკი მეტია ან ტოლი 18 - ის დაბეჭდეთ მნიშვნელობა 'You are an adult' სხვა შემთხვევაში კი 'You are a kid'

age = int(input("შეიყვანე შენი ასაკი: "))
if age >= 18:
    print("You are an adult") 
else:
    print("You are a kid") 

#4) მომხმარებელს შემოატანინეთ რაიმე რიცხვი თქვენი დავალებაა რომ 0 - დან გადმოცემული რიცხვის ჩათვლით დაბეჭდოთ რიცხვები
number = int(input("შეიყვანე რიცხვი: "))

for i in range(0, number + 1):
    print(i)