// HELPER არის ჩვეულებრივი ფუნქცია, რომელიც იქმნება სხვა (მთავარი) 
// ფუნქციის დასახმარებლად. ის ასრულებს პატარა, კონკრეტულ ამოცანას 
// და ამით მთავარ ფუნქციას ხდის უფრო მარტივს, სუფთას და ადვილად წასაკითხს.
//ARROW FUNCTION არის ფუნქციის დაწერის შემოკლებული და თანამედროვე სინტაქსი 
// `function` სიტყვის ნაცვლად გამოიყენება ისარი `=>`.
// განსაკუთრებით მოსახერხებელია მოკლე, ერთხაზიანი მოქმედებების დასაწერად.

// `return` გამოიყენება ფუნქციიდან შედეგის დასაბრუნებლად.
// ის აჩერებს ფუნქციის შესრულებას იმწამსვე — `return`-ის ქვემოთ 
//    დაწერილი კოდი იმავე ფუნქციაში აღარ შესრულდება.