/*
  ES6 არის JavaScript სტანდარტის მნიშვნელოვანი განახლება, 
  რომელმაც ენას შემატა ბევრი თანამედროვე შესაძლებლობა 
  ცვლადების გამოცხადებისთვის ES6-მა შემოიღო 2 ახალი საკვანძო სიტყვა (keyword):

  1. let - გამოიყენება ცვლადებისთვის, რომელთა მნიშვნელობის შეცვლაც (re-assignment) 
     სამომავლოდ იგეგმება. აქვს Block Scope (ხელმისაწვდომია მხოლოდ იმ ბლოკში {}, სადაც გამოცხადდა).

  2. const - გამოიყენება მუდმივი (constant) ცვლადებისთვის, რომელთა მნიშვნელობის 
     ხელახლა მინიჭებაც არ შეიძლება. ასევე აქვს Block Scope.
*/