/*
  var:
  - Function Scope (მოქმედებს ფუნქციის ფარგლებში)
  - ნებადართულია ხელახლა გამოცხადება (Re-declaration)
  - ნებადართულია მნიშვნელობის შეცვლა (Re-assignment)
  - განიცდის Hoisting-ს და ინიციალიზდება undefined-ით

  let:
  - Block Scope (მოქმედებს მხოლოდ {} ბლოკში)
  - აკრძალულია ხელახლა გამოცხადება იმავე ბლოკში
  - ნებადართულია მნიშვნელობის შეცვლა (Re-assignment)
  - გადადის Temporal Dead Zone (TDZ)-ში გამოცხადებამდე

  const:
  - Block Scope (მოქმედებს მხოლოდ {} ბლოკში)
  - აკრძალულია ხელახლა გამოცხადება
  - აკრძალულია მნიშვნელობის შეცვლა (Re-assignment)
  - სავალდებულოა მნიშვნელობის მინიჭება გამოცხადებისთანავე
*/