# ფუნქცია  არის კოდის ბლოკი, რომელიც ასრულებს კონკრეტულ მოქმედებას.
# მისი გამოყენება შეგვიძლია რამდენჯერაც გვიდან

# პარამეტრი არის ცვლადი, გამოიყენება ფუნქციის შიგნით მონაცემის მისაღებად
# არგუმენტი არის რეალური მნიშვნელობა, რომელსაც ფუნქციის გამოძახებისას გადავცმთ.



def check_age(age):  
    if age < 13:
        print("ბავშვი")
    elif age < 18:
        print("მოზარდი")
    else:
        print("ზრდასრული")

check_age(10)
check_age(15)
check_age(20)


# ჩაშენებული ფუნქციები არის Python-ში უკვე არსებული ფუნქციები.

# len() - აბრუნებს ელემენტების რაოდენობას
text = "Python"
print(len(text))  

# type() - აჩვენებს მონაცემის ტიპს
ი = 10
print(type(ი))  

# int(), str(), float() - მონაცემის ტიპის შეცვლა
num = "25"
print(int(num) + 5)   


# sum() - აჯამებს სიას
numbers=(1 , 3 ,3, 5)
print(sum(numbers))  

# input() - მომხმარებლისგან მონაცემის მიღება
name = input("შეიყვანე შენი სახელი: ")
print("xelou,", name)
