# მონაცემთა ტიპი განსაზღვრავს თუ რა სახის მნიშვნელობას ინახავს ცვლადი
# და რა ოპერაციების შესრულება შეიძლება მასზე

# ძირითადი მონაცემთა ტიპები:

number_int = 10          # int – მთელი რიცხვი
number_float = 3.14      # float – ათწილადი რიცხვი
text = "Hello Python"    # str – ტექსტი
is_active = True         # bool – ლოგიკური მნიშვნელობა (True / False)
numbers_list = [1, 2, 3] # list – სია


#კომპიუტერი კოდს კითხულობს ზემოდან ქვემოთ, ხაზ-ხაზ

x = 5
print(x)

x = 20  # აქ x-ის მნიშვნელობა იცვლება
print(x)